
//Функция, чтобы избежать дублирования
&НаКлиенте
Функция ЗаполнитьСуммуПосещения()
	Объект.СуммаПосещения = (Объект.КоличествоМинут * ПолучитьЦенуПосещения(Объект.КодЦены)) * Объект.КоличествоПерсон;	
КонецФункции

//Расчет суммы посещения в зависимости от дня посещения (цены), количества минут и количества персон
&НаКлиенте
Процедура КоличествоМинутПриИзменении(Элемент)
	Если  ЗначениеЗаполнено(Объект.КодЦены) И ЗначениеЗаполнено(Объект.КоличествоПерсон) Тогда
		ЗаполнитьСуммуПосещения();	
	КонецЕсли	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦенуПосещения(СпрЦена)
	Справочники.Цена.НайтиПоКоду(СпрЦена);
	Возврат СпрЦена.ЦенаЗаМинуту;
КонецФункции

&НаКлиенте
Процедура КодЦеныПриИзменении(Элемент)
	Если  ЗначениеЗаполнено(Объект.КоличествоМинут) И ЗначениеЗаполнено(Объект.КоличествоПерсон) Тогда
		ЗаполнитьСуммуПосещения();	
	КонецЕсли	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПерсонПриИзменении(Элемент)
	Если  ЗначениеЗаполнено(Объект.КоличествоМинут) И ЗначениеЗаполнено(Объект.КодЦены) Тогда
		ЗаполнитьСуммуПосещения();	
	КонецЕсли
КонецПроцедуры
