
&НаКлиенте
Процедура Загрузить(Команда)
	Файл = Новый Файл(Объект.ПутьКФайлу);
	
	Если Файл.Существует() Тогда
		ДД = Новый ДвоичныеДанные(Объект.ПутьКФайлу);
		ЗагрузитьНаСервере(ДД);
		
		ЭтаФорма.Модифицированность = Ложь;
		ОбновитьКартинку();
		Объект.ФотоВывод = "Да";
	Иначе
		Сообщить ("Загрузите картинку");
	КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(ДД)
	Хранилище = Новый ХранилищеЗначения(ДД);
	Об = РеквизитФормыВЗначение("Объект");
	Об.Фотография = Хранилище;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры 

&НаСервере
Процедура ОбновитьКартинку()
	Картинка = ПоместитьВоВременноеХранилище(Объект.Ссылка.Фотография.Получить(), УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите изображение";
	Диалог.МножественныйВыбор = Ложь;
	Диалог.Фильтр = "Файл jpeg, png, jpg | *.jpeg; *.png; *.jpg";
	
	Если Диалог.Выбрать() Тогда
		Объект.ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.ФотоВывод = "Да" Тогда
		ОбновитьКартинку();
	Иначе
		Картинка = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ЗаглушкаТовар, УникальныйИдентификатор);
	КонецЕсли
КонецПроцедуры
