
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ДобавитьПользователяИБ(Объект.Наименование, Объект.Должность);
КонецПроцедуры

&НаСервере
Процедура ДобавитьПользователяИБ(ФИО, Должность)
	РазбитоеФИО = СтрРазделить(ФИО, " ");
	Если ЗначениеЗаполнено(ФИО) И ЗначениеЗаполнено(Должность) Тогда
			НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовыйПользовательИБ.Имя = РазбитоеФИО[0];
			НовыйПользовательИБ.ПолноеИмя = ФИО;
			НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.Найти(Должность));
			НовыйПользовательИБ.Записать();
	     	Сообщить("Пользователь записан");
	Иначе
		Сообщить("Проверьте заполненность наименования");
		Отказ = Истина;
	КонецЕсли	
КонецПроцедуры

&НаСервере
Функция ПроверитьУникальностьИмени(Имя)
	Возврат ПользователиИнформационнойБазы.НайтиПоИмени(Объект.Наименование) 	
КонецФункции
