
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ТипАкта = ПредопределенноеЗначение("Перечисление.ТипАкта.АктПередачи");
КонецПроцедуры

//&НаКлиенте
//Процедура СоставАктаКотикНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	
//	ФормаВыбора = ПолучитьФормуВыбора(); //Справочники.Котики.ПолучитьФормуВыбора();
//	ФормаВыбора.Отбор.Ссылка.СтатусНахождения = ПолучитьЗначениеФильтра();
//	ЭтотОбъект.СоставАкта.Котик = ФормаВыбора.ОткрытьМодально();
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьФормуВыбора() 
//	Возврат Справочники.Котики.ПолучитьФормуВыбора();	
//КонецФункции

//&НаСервере
//Функция ПолучитьЗначениеФильтра() 
//	Возврат Перечисления.СтатусНахождения.ВКотокафе;	
//КонецФункции