
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвиженияЖивотных 
	Движения.ДвиженияЖивотных.Записывать = Истина;
	Для Каждого ТекСтрокаСоставАкта Из СоставАкта Цикл
		Движение = Движения.ДвиженияЖивотных.Добавить();
		Движение.Период = Дата;
		Движение.Акт = ТипАкта;
		Движение.Количество = ТекСтрокаСоставАкта.НомерСтроки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
