
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
		// Для каждого столбца
	Для Каждого Ст из Строки Цикл
		// Проверяем загружалась ли картинка
		Если Ст.Ключ.Ссылка.ФотоВывод = "Да" Тогда
			// И если загружалась, то в столбец мы вставляем изображение из реквизита "Фотография"
			Ст.Значение.Данные.ФотоВывод = ПолучитьНавигационнуюСсылку(Ст.Ключ, "Фотография");
		Иначе
			// Если она не загружалась, то бы вставляем туда заглушку
			Ст.Значение.Данные.ФотоВывод = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.ЗаглушкаКотик, Ст.Ключ);
		КонецЕсли
		КонецЦикла

КонецПроцедуры
