// Расчет цен в столбце "Сумма" табличной части

//При смене товара - обнуляем количество
&НаКлиенте
Процедура СоставПродажиТоварПриИзменении(Элемент)
	СтрокаТЧ = Элементы.СоставПродажи.ТекущиеДанные;
	СтрокаТЧ.Количество = 0;
КонецПроцедуры

&НаСервере 
Функция ПолучитьЦену(СпрТовар)
	Возврат СпрТовар.Цена;
КонецФункции

//Расчет суммы по строке табличной части
&НаКлиенте
Процедура СоставПродажиКоличествоПриИзменении(Элемент)   

	СтрокаТЧ = Элементы.СоставПродажи.ТекущиеДанные;
	Товар = СтрокаТЧ.Товар;
	Цена = ПолучитьЦену(СтрокаТЧ.Товар);
	Количество = СтрокаТЧ.Количество;
	КоличествоТовараНаСкладе = ПолучитьКоличествоНаСкладе(Товар);
	Если КоличествоТовараНаСкладе = Неопределено Тогда
		Сообщить("Товар отсутствует на складе");
		СтрокаТЧ.Количество = 0;
	Иначе
		Если КоличествоТовараНаСкладе < Количество Тогда
		Сообщить("Недостаточно товара на складе!");
		СтрокаТЧ.Количество = 0;
	Иначе
		СуммаСтроки = ОбщийМодуль.РассчитатьСумму(Цена, Количество);
		СтрокаТЧ.Сумма = СуммаСтроки;
		Объект.СуммаПродажи = Объект.СоставПродажи.Итог("Сумма");	
	КонецЕсли

	КонецЕсли
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоНаСкладе(СпрТовар)
	
	Попытка 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Товар,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|ГДЕ 
		|	ОстаткиТоваровОстатки.Товар = &Товар"; 
		
		Запрос.УстановитьПараметр("Товар", СпрТовар);
		РезультатЗапроса = Запрос.Выполнить();
		НаборЗаписей = РезультатЗапроса.Выбрать();

		Пока НаборЗаписей.Следующий() Цикл
			Возврат НаборЗаписей.КоличествоОстаток;
		КонецЦикла;
	Исключение
		Возврат -1;
	КонецПопытки
КонецФункции